poaonrails/app/controllers/features_controller.rb

  def index
    @features = Feature.all
---
SELECT "features".* FROM "features"