poaonrails/app/controllers/ratings_controller.rb

  def list
    school_id = params[:school_id]
    @school = School.find(school_id)
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]

  def register
    rating_params = extract_rating_params()
    rating = Rating.create(rating_params)
---
INSERT INTO "ratings" ("user_id", "school_id", "pros", "cons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["school_id", 2], ["pros", "good"], ["cons", "bad"], ["created_at", "2019-11-23 19:42:19.026900"], ["updated_at", "2019-11-23 19:42:19.026900"]]

  def create
    @rating = Rating.new(rating_params)

    respond_to do |format|
      if @rating.save
---
INSERT INTO "ratings" ("user_id", "school_id", "pros", "cons", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @rating.update(rating_params)
---
UPDATE "ratings" SET "category" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["category", "USER"], ["updated_at", "2019-11-23 19:14:29.837567"], ["id", 1]]

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT 1  [["id", 1]]