poaonrails/app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "vacancy", "rating", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save