poaonrails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "cpf", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def register
    user_params = extract_user_params()
    user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ?  ORDER BY "users"."id" DESC LIMIT 1  [["email", "mario.figueiro@gmail.com"], ["password", "sdjsalkdjklasjkds"]]
---
  def login
    email = params[:email]
    password = params[:password]
    user = User.where(email: email, password: password).last

INSERT INTO "users" ("name", "email", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mario Figueiro"], ["email", "mario.figueiro@ufrgs.br"], ["cpf", "85841846000"], ["created_at", "2019-11-23 19:07:01.507622"], ["updated_at", "2019-11-23 19:07:01.507622"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save